# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on One-to-Many and Many-to-many relationships!

## Objectives

You will be able to:
- Query data including Many-to-Many relationships
- Write queries that make use of Join Tables

## One-to-Many and Many-to-Many Joins
<img src='Database-Schema.png' width=550>

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [1]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

In [9]:
#Your code here
cur.execute('''SELECT firstName,lastName,city,state FROM employees GROUPBY JOIN offices USING (officeCode) GROUP BY firstName,lastName;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head(10)

  firstName   lastName           city state
0      Andy     Fixter         Sydney
1   Anthony        Bow  San Francisco    CA
2     Barry      Jones         London
3     Diane     Murphy  San Francisco    CA
4  Foon Yue      Tseng            NYC    NY
5    George     Vanauf            NYC    NY
6    Gerard     Bondur          Paris
7    Gerard  Hernandez          Paris
8      Jeff   Firrelli  San Francisco    CA
9     Julie   Firrelli         Boston    MA

## Customers and their Orders (a One-to-Many join)

Return a list of all of the customers. For each customer return a record for each of their order numbers, order dates and statuses.

In [11]:
# Your code here
cur.execute('''SELECT orderNumber,orderDate,status FROM orders JOIN customers USING(customerNumber); ''')
df = pd.DataFrame(cur.fetchall())
df.head()

       0           1        2
0  10100  2003-01-06  Shipped
1  10101  2003-01-09  Shipped
2  10102  2003-01-10  Shipped
3  10103  2003-01-29  Shipped
4  10104  2003-01-31  Shipped

## Orders and their Order Details (another One-to-Many join)

Return a list of orders. For each order return a record for each order detail within the order.

In [12]:
# Your code here
cur.execute('''SELECT * FROM orders JOIN orderdetails USING(orderNumber);''')
df = pd.DataFrame(cur.fetchall())
df.head()

,0,1,2,3,4,5,6,7,8,9,10
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S18_1749,30,136.00,3
1,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S18_2248,50,55.09,2
2,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S18_4409,22,75.46,4
3,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,S24_3969,49,35.29,1
4,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128,S18_2325,25,108.06,4

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of the orders with the the order information, and all the product information for each product in the order.

In [14]:
# Your code here
cur.execute('''SELECT * FROM orders JOIN products ON (orders.orderNumber = products.productCode);''')
df = pd.DataFrame(cur.fetchall())
df.head()

Empty DataFrame
Columns: []
Index: []

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!